import sqlite3

# Σύνδεση με την Database
conn = sqlite3.connect("questions.db")
cursor = conn.cursor()

# Δημιουργία πίνακα ερωτήσεων στη βάση
cursor.execute("""
CREATE TABLE IF NOT EXISTS questions (
    id INTEGER PRIMARY KEY,
    question TEXT,
    option_a TEXT,
    option_b TEXT,
    option_c TEXT,
    option_d TEXT,
    answer TEXT,
    level INTEGER
)
""")

# Level 1 ερωτήσεις
level_1_questions = [
    ("Ποιά είναι η πρωτέυουσα της Γαλλίας?", "Παρίσι", "Μαδρίτη", "Βερολίνο", "Λονδίνο", "Παρίσι", 1),
    ("Ποιος είναι ο μεγαλύτερος Πλανήτης του Ηλιακού μας συστήματος?", "Δίας", "Κρόνος", "Άρης", "Γη", "Δίας", 1),
    ("Ποια είναι η μικρότερη χώρα στον Κόσμο?", "Βατικανό", "Μονακό", "Λιχνενσταιν", "Σαν Μαρίνο", "Βατικανό", 1),
    ("Ποιος ζωγράφισε την Μόνα Λίζα?", "Λεονάρντο Ντα Βιντσι", "Μικελάντζελο", "Ραφαήλ", "Ντονατέλο", "Λεονάρντο Ντα Βιντσι", 1),
    ("Ποιο είναι το ψηλότερο βουνό της Αφρικής?", "Κιλιμάντζαρο", "Έβερεστ", "Ακονγκουα", "Όρος Ντενάλι", "Κιλιμάντζαρο", 1),
    ("Ποιο είναι το μεγαλύτερο θηλαστικό στον κόσμο?","Ελέφαντας","Γαλάζια Φάλαινα", "Ιπποπόταμος","Καμηλοπάρδαλη", "Γαλάζια Φάλαινα",1),
    ("Ποιος έγραψε το βιβλίο 'Όταν σκοτώνουν τα Κοτσίφια'?", "Έρνεστ Χεμινγουει","ΣκοτΦιτζεραλαντ","Χάρπερ Λι","Τζον Σταινμπεκ","Χάρπερ Λι",1),
    ("Ποιο είναι το πουλί με το μεγαλύτερο άνοιγμα φτερών στον κόσμο?", "Στρουθοκάμυλος" , "Φαλακρός Αετός" , "Αλμπατρος","Κόνδωρας","Αλμπατρος",1),
    ("Ποια είναι η πρωτεύουσα της Ν. Κορέας?", "Τόκιο", "Πεκίνο", "Σεούλ", "Τάι-Πέι","Σεούλ",1),
    ("Ποιο είναι το χημικό στοιχείου του νερού?", "H2O", "CO2", "O2", "NaCl","H2O",1),
    ("Ποιος ήταν ο Θεόφιλος Καταρράκης?","Πολιτικός","Καλλιτέχνης","Ιατρός","Αθλητής","Καλλιτέχνης",1),
    ("Τι χρώμα έχει ο ουρανός την ημέρα?","Άσπρο","Γαλάζιο","Μπλε","Υπόλευκο","Γαλάζιο",1),
    ("Ποια είναι η πρωτεύουσα της Κίνας;?","Πεκίνο","Γκουαντζόου","Σαγκάη","Τάι Πει","Πεκίνο",1),
    ("Ποιο είναι το πιο ευρέως χρησιμοποιούμενο νόμισμα στον κόσμο?","Δολάριο ΗΠΑ","Ρώσσικο Ρούβλι","Γιεν","Στερλίνα","Δολάριο ΗΠΑ",1),
    ("Ποιο είναι το χρώμα του αίματος χωρίς οξυγόνο?","Μαύρο","Κόκκινο","Καφέ","Μπλε","Μαύρο",1),
    ("Ποιο είναι το πιο ευρέως χρησιμοποιούμενο φυτικό έλαιο στη μαγειρική?","Ηλιέλαιο","Ελαιόλαδο","Σόγιας","Καρύδας","Σόγιας",1),
    ("Ποια είναι η μονάδα μέτρησης της απόστασης στο διεθνές σύστημα μονάδων?","Μέτρο","Εκατοστό","Ίντσα","Κιλόμετρο","Μέτρο",1)
]

# Level 2 ερωτήσεις
level_2_questions = [
    ("Ποιο είναι το μεγαλύτερο όργανο στο ανθρώπινο σώμα?", "Δέρμα", "Συκώτι", "Καρδιά", "Πνεύμονες", "Δέρμα", 2),
    ("Ποια είναι η πρωτεύουσα της Αυστραλίας?", "Κανμπέρα", "Σύδνει", "Μελβούρνη", "Μπισμπέιν", "Κανμπέρα", 2),
    ("Ποιος είναι ο μεγαλύτερος ποταμός την Ν.Αμερικής?", "Αμαζόνιος", "Νείλος", "Ποταμός του Κονγκό", "Ποταμός Γιάτζι", "Αμαζόνιος", 2),
    ("Ποιος πλανήτης έχει την μικρότερη μέρα?", "Αφροδίτη", "Ερμής", "Γη", "Άρης", "Ερμής",2),
    ("Πότε ξεκίνησε ο Β' Παγκόσμιος Πόλεμος?", "1914" , "1935", "1939", "1945","1939",2),
    ("Ποιος έγραψε τον 'Φύλακα της Σίκαλης'?", "Σάλινγκερ" , "Χεμινγουει", "Σκοτ Φιτζεραλντ", "Φολκνερ","Σάλινγκερ",2),
    ("Ποιο το χημικό σύμβολο του Ποτάσιου?", "K", "P", "Ka", "Po","K",2),
    ("Ποιος δημιούργησε την 'Έναστρη Νύχτα?", "Βαν Γκογκ", "Πικάσσο", "Ντα Βίντσι", "Μικελάτζελο","Βαν Γκογκ",2),
    ("Ποια ομάδα κατέκτησε τον τίτλο του ΝΒΑ το 2020?","Los Angeles Lakers","Golden STate Warriors","Houston Rockets","Miamai Heat","Los Angeles Lakers",2),
    ("Ποιος ποδοσφαιριστής κατέχει το ρεκόρ των περισσότερων νικών στο Παγκόσμιο Κύπελλο?","Λιονελ Μεσι","Ντιέγκο Μαραντονα","Πελέ","Καφού","Καφού",2),
    ("Ποιος τενίστας κέρδισε τον τίτλο του Ολυμπιακού Πρωταθλητή στους αγώνες του Ρίο το 2016?","Rafa Nadal","Roger Federer","Novak Djokovic","Andy Murray","Andy Murray",2),
    ("Ποιος κολυμβητής κέρδισε τον τίτλο του παγκόσμιου πρωταθλητή στα 100μ ελεύθερο στο Παγκόσμιο Πρωτάθλημα Κολύμβησης του 2019?","Adam Peaty","Caeleb Dressel","Nathan Adrian","Kyle Chalmers","Caeleb Dressel",2),
]

# Level 3 ερωτήσεις
level_3_questions = [
    ("Ποια είναι η μεγαλύτερη έρημος της Γης", "Σαχάρα", "Αραβική", "Γκόμπι", "Ανταρκτική", "Ανταρκτική", 3),
    ("Ποιος ανέβηκε πρώτος στην κορυφή του Έβερεστ?", "Εντμουντ Χίλαρι", "Τενζιν Νοργκουει", "Ρεινολντ Μέσνερ", "Τζούνκο Ταμπέι", "Εντμουντ Χίλαρι", 3),
    ("Ποια ήταν η πρώτη γυναίκα που κέρδισε Βρ. Νόμπελ Φυσικής?", "Ρόζαλιντ Φράκλιν", "Μαρία Κιουρί", "Τσιεν-Τζουν Γου", "Λίζα Μέιτνερ","Μαρία Κιουρί",3),
    ("Ποιο είναι το πιο βαθύ σημείο στους ωκεανούς της Γης?", "Τσάλεντζερ", "Μαριάνα", "Πουέρτο Ρίκο", "Καμτσάκτα","Τσάλεντζερ",3),
    ("Ποια είναι η μεγαλύτερη χώρα παραγωγός κακάο στον Κόσμο?", "Γκάνα", "Ακτή Ελεφαντοστού", "Βραζιλία", "Ινδονησία","Ακτή Ελεφαντοστού",3),
    ("Ποιος έγραψε το Πόλεμος και Ειρήνη?", "Λέο Τολστόι", "Φίοντορ Ντοστογιέφσκι", "Αντον Τσέχοφ", "Ιβάν Τουγκενέβ","Λέο Τολστόι",3),
    ("Ποια είναι η πρωτεύουσα της Αιθιοπίας?", "Άντις Αμπέμπα","Χαράρε", "Ναιρόμπι", "Χαρτούμ","Άντις Αμπέμπα",3),
    ("Ποιο είναι το χημικό σύμβολο της Πλατίνας?" ,"Pt", "Pl", "Pn", "Pm","Pt",3),
]

# Εισαγωγή των ερωτήσεων στη βάση
questions = level_1_questions + level_2_questions + level_3_questions
cursor.executemany("INSERT INTO questions (question, option_a, option_b, option_c, option_d, answer, level) VALUES (?, ?, ?, ?, ?, ?, ?)", questions)

# Commit στη βάση και κλείσιμο της
conn.commit()
conn.close